package com.mayreh.typo.web.tool;

import lombok.Value;

import java.util.ArrayList;
import java.util.Arrays;
import java.util.Collections;
import java.util.List;
import java.util.regex.Pattern;

public class MoraTokenizer {
    @Value
    public static class Token {
        String mora;
    }

    public static final Pattern SUPPORTED_PATTERN = Pattern.compile(
            "^[ぁ-んァ-ン０-９0-9,.、。ー\\-]*$");

    public static List<Token> tokenize(String text) {
        if (!SUPPORTED_PATTERN.matcher(text).matches()) {
            throw new IllegalArgumentException("contains unsupported character: " + text);
        }

        final List<Token> result = new ArrayList<>();
        int i = 0;
        while (i < text.length()) {
            boolean found = false;
            for (String mora : SUPPORTED_MORAS) {
                if (text.substring(i).startsWith(mora)) {
                    result.add(new Token(mora));
                    i += mora.length();
                    found = true;
                    break;
                }
            }

            if (!found) {
                throw new IllegalArgumentException("mora not found: " + text);
            }
        }

        return result;
    }

    private static final String[] SUPPORTED_MORAS = new String[] {
            "０",
            "0",
            "１",
            "1",
            "２",
            "2",
            "３",
            "3",
            "４",
            "4",
            "５",
            "5",
            "６",
            "6",
            "７",
            "7",
            "８",
            "8",
            "９",
            "9",

            "あ","ぁ","い","ぃ","いぇ","う","ぅ","ゐ","うぃ","うぇ","うぉ","ゔ","ゔぁ","ゔぃ","ゔぇ","ゔぉ","え","ぇ","ゑ","お","ぉ","か","が","き","きゃ","きぃ","きゅ","きぇ","きょ","ぎ","ぎゃ","ぎぃ","ぎゅ","ぎぇ","ぎょ","く","くぁ","くぃ","くぇ","くぉ","ぐ","ぐぁ","ぐぃ","ぐぅ","ぐぇ","ぐぉ","け","げ","こ","ご","さ","ざ","し","しゃ","しぃ","しゅ","しぇ","しょ","じ","じゃ","じぃ","じゅ","じぇ","じょ","す","ず","せ","ぜ","そ","ぞ","た","だ","ち","ちゃ","ちぃ","ちゅ","ちぇ","ちょ","ぢ","ぢゃ","ぢぃ","ぢゅ","ぢぇ","ぢょ","っ","つ","つぁ","つぃ","つぇ","つぉ","づ","て","てゃ","てぃ","てゅ","てぇ","てょ","で","でゃ","でぃ","でゅ","でぇ","でょ","と","ど","どぁ","どぃ","どぅ","どぇ","どぉ","な","に","にゃ","にぃ","にゅ","にぇ","にょ","ぬ","ね","の","は","ば","ぱ","ひ","ひゃ","ひぃ","ひゅ","ひぇ","ひょ","び","びゃ","びぃ","びゅ","びぇ","びょ","ぴ","ぴゃ","ぴぃ","ぴゅ","ぴぇ","ぴょ","ふ","ふぁ","ふぃ","ふぇ","ふぉ","ぶ","ぷ","へ","べ","ぺ","ほ","ぼ","ぽ","ま","み","みゃ","みぃ","みゅ","みぇ","みょ","む","め","も","や","ゃ","ゆ","ゅ","よ","ょ","ら","り","りゃ","りぃ","りゅ","りぇ","りょ","る","れ","ろ","わ","を","ん",
            "ア","ァ","イ","ィ","イェ","ウ","ゥ","ヰ","ウィ","ウェ","ウォ","ヴ","ヴァ","ヴィ","ヴェ","ヴォ","エ","ェ","ヱ","オ","ォ","カ","ガ","キ","キャ","キィ","キュ","キェ","キョ","ギ","ギャ","ギィ","ギュ","ギェ","ギョ","ク","クァ","クィ","クェ","クォ","グ","グァ","グィ","グゥ","グェ","グォ","ケ","ゲ","コ","ゴ","サ","ザ","シ","シャ","シィ","シュ","シェ","ショ","ジ","ジャ","ジィ","ジュ","ジェ","ジョ","ス","ズ","セ","ゼ","ソ","ゾ","タ","ダ","チ","チャ","チィ","チュ","チェ","チョ","ヂ","ヂャ","ヂィ","ヂュ","ヂェ","ヂョ","ッ","ツ","ツァ","ツィ","ツェ","ツォ","ヅ","テ","テャ","ティ","テュ","テェ","テョ","デ","デャ","ディ","デュ","デェ","デョ","ト","ド","ドァ","ドィ","ドゥ","ドェ","ドォ","ナ","ニ","ニャ","ニィ","ニュ","ニェ","ニョ","ヌ","ネ","ノ","ハ","バ","パ","ヒ","ヒャ","ヒィ","ヒュ","ヒェ","ヒョ","ビ","ビャ","ビィ","ビュ","ビェ","ビョ","ピ","ピャ","ピィ","ピュ","ピェ","ピョ","フ","ファ","フィ","フェ","フォ","ブ","プ","ヘ","ベ","ペ","ホ","ボ","ポ","マ","ミ","ミャ","ミィ","ミュ","ミェ","ミョ","ム","メ","モ","ヤ","ャ","ユ","ュ","ヨ","ョ","ラ","リ","リャ","リィ","リュ","リェ","リョ","ル","レ","ロ","ワ","ヲ","ン",

            ",",
            ".",
            "、",
            "。",
            "ー",
            "-"
    };

    static {
        Arrays.sort(SUPPORTED_MORAS, Collections.reverseOrder((l, r) -> {
            if (l.length() < r.length()) {
                return -1;
            } else if (l.length() > r.length()) {
                return 1;
            } else {
                return l.compareTo(r);
            }
        }));
    }
}
